app/views/owners/show.html.erb

SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" = 7
SELECT 1 AS one FROM "pets" WHERE "pets"."owner_id" = 7 LIMIT 1
---
<h4>Pets</h4>
<% if @owner.pets.any? %>

SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" = 7
---
    <tbody>
      <% @owner.pets.each do |pet| %>