app/views/pets/index.html.erb

SELECT "owners".* FROM "owners" WHERE "owners"."id" = 7 LIMIT 1
---
        <td><%= pet.breed %></td>
        <td><%= link_to "#{pet.owner.first_name} #{pet.owner.last_name}", owner_path(pet.owner) %></td>