app/views/pets/show.html.erb

SELECT "owners".* FROM "owners" WHERE "owners"."id" = 7 LIMIT 1
---
    <li class="list-group-item"><strong>Weight:</strong> <%= @pet.weight %> kg</li>
    <li class="list-group-item"><strong>Owner:</strong> <%= link_to "#{@pet.owner.first_name} #{@pet.owner.last_name}", owner_path(@pet.owner) %></li>

SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = 1
SELECT 1 AS one FROM "appointments" WHERE "appointments"."pet_id" = 1 LIMIT 1
---
<h4>Appointments</h4>
<% if @pet.appointments.any? %>

SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = 1
---
    <tbody>
      <% @pet.appointments.each do |appointment| %>